app/controllers/albums_controller.rb

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
    def show
      @album = Album.find(params[:id])

SELECT * FROM `artists` WHERE (`artists`.`id` IS NULL) LIMIT 1
INSERT INTO `albums` (`genre`, `price`, `image_path`, `title`, `release_date`, `artist_id`, `created_at`, `updated_at`) VALUES('Rock', 0.0, '', 'Abbey Road', '2014-03-13 12:20:00', 0, '2014-03-13 12:20:00', '2014-03-13 12:24:03')
---
    def create
      @album = Album.new(params[:album])
      artist = Artist.find_by_id(params[:artist_id])
      @album.artist = artist
      @features = Feature.find(:all)
      checked_features = check_features_using(params[:feature_list])
      uncheck_missing_features(@features, checked_features)
      if @album.save

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
    def edit
      @artists = Artist.find(:all)
      @features = Feature.find(:all)
      @album = Album.find(params[:id])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
SELECT * FROM `artists` WHERE (`artists`.`id` = 0)
UPDATE `albums` SET `artist_id` = 'Beates', `updated_at` = '2014-03-13 17:16:35' WHERE `id` = 1
---
    def update
      @album = Album.find(params[:id])
      artist = Artist.find_by_id(params[:artist_id])
      @album.artist = artist
      @features = Feature.find(:all)
      checked_features = check_features_using(params[:feature_list])
      uncheck_missing_features(@features, checked_features)
      if @album.update_attributes(params[:album])

DELETE FROM `albums` WHERE `id` = 8
SELECT * FROM `albums` WHERE (`albums`.`id` = 8)
---
    def destroy
      Album.find(params[:id]).destroy