app/controllers/public_controller.rb

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
	def add_to_cart
		# when the user picks up an item or product, this method would
		# allow that item to add into the shopping cart.
		# when the user picks up an item, it creates the new cart for that user.

		album = Album.find(params[:id])